#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cloudysky/terraform-sandeep-aws/runs/run-FXCP6xCxN87Uo9NP

Waiting for the plan to start...

Terraform v1.5.2
on linux_amd64
Initializing plugins and modules...
data.aws_subnet.existing_subnet: Refreshing...
data.aws_subnet.existing_subnet: Refresh complete after 0s [id=subnet-053560d78725d4149]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_security_group.cloud9_secgroup will be read during apply
  # (config refers to values not yet known)
 <= data "aws_security_group" "cloud9_secgroup" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + tags        = (known after apply)
      + vpc_id      = (known after apply)

      + filter {
          + name   = "tag:aws:cloud9:environment"
          + values = [
              + (known after apply),
            ]
        }
    }

  # aws_cloud9_environment_ec2.cloud9_instance will be created
  + resource "aws_cloud9_environment_ec2" "cloud9_instance" {
      + arn                         = (known after apply)
      + automatic_stop_time_minutes = 30
      + connection_type             = "CONNECT_SSH"
      + id                          = (known after apply)
      + instance_type               = "t2.medium"
      + name                        = "cloud9_instance"
      + owner_arn                   = (known after apply)
      + subnet_id                   = "subnet-053560d78725d4149"
      + tags                        = {
          + "Terraform" = "true"
        }
      + tags_all                    = {
          + "Terraform" = "true"
        }
      + type                        = (known after apply)
    }

  # aws_security_group_rule.tcp_8080 will be created
  + resource "aws_security_group_rule" "tcp_8080" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloud9_url = (known after apply)

```

</details>

*Pushed by: @SandeepKumarYaramchitti, Action: `pull_request`*